Revit 2027 API
Transaction.GetStatus Method
 Returns the current status of the transaction.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TransactionStatus GetStatus()
Public Function GetStatus As TransactionStatus
public:
TransactionStatus GetStatus()
member GetStatus : unit -> TransactionStatus
Return Value
TransactionStatus
 The current status of the transaction.
Remarks
 If the status was set to TransactionStatus.Pending as the result of calling Commit or RollBack, the status will be changed later to either 'Committed' or 'RolledBack' after failure handling is finished. That status change will be made asynchronously.
See Also
Reference
Transaction Class
Autodesk.Revit.DB Namespace